Repository: PavelKhrapkin/TSmach
Catalog: TSmatch/Properties/TSmatchMsg.*.resx
Languages: ru

# Message__Init_fault
source: TSmatch Fatal internal Error in [Message.Init] -- Initialization fault Message System
ru: TSmatch внутренняя ошибка [Message.Init] -- Ошибка инициализации системы сообщений

# Component__wrong_LoadDescriptor
source: [Component]: Wrong LoadDescriptor "{0}". Please, chech TSmatch.xlsx/TOC
ru: [Component]: Ошибка описания компоненты "{0}". Проверьте TSmatch.xlsx/TOC

# Document__Reset_no_HDR_Form
source: [Document]: Reset of the Document "{0}", which has no HDR form in TOC
ru: [Document.Reset]: Reset документа "{0}", для которого нет формы HDR в ТОС

# Document__wrDoc_no_Form
source: [Document.wrDoc]: No form "{0}" for this Document "{1}"
ru: [Document.wrDoc]: Нет формы "{0}" для документа "{1}"

# MainWindow__RePrice
source: Material Price Re-calculation
ru: Пересчет стоимости материалов

# MainWindow__Title
source: TSmatch - Building Materials and Suppliers Management
ru: TSmatch - согласование поставщиков в проекте

# Splash__Loading_Bootstrap
source: [Bootstrap]: Loading file TSmatch.xlsx
ru: [Bootstrap]: Загрузка диспетчерской базы TSmatch.xlsx

# S
source: Loading
ru: Гружу

# SectionTab_is_empty
source: [Section]: SectionTab is not initialized
ru: [Section]: не инициализирован словарь секций SectionTab

# SavedReport__SetModelDir_No_Model_Directory
source: [SavedReport.SetModelDir]: No "TSmatchINFO.xlsx" in model directory Ensure, that this file is written by TSmatch application, when Tekla is available
ru: [SavedReport.SetModelDir]: В каталоге модели нет файла "TSmatchINFO.xlsx". Убедитесь, что он сохранен приложением TSmatch, когда модель доступна в Tekla

# SavedReport__SetModelDir_No_TSmatchINFO
source: [SavedReport.SetModelDir]: No model directory "{0}" is available
ru: [SavedReport.SetModelDir]: недоступен каталог модели "{0}"

# SavedReport__error_recover_impossible
source: [SavedReport.error] : Saved model is corrupted, and we cannot resore it. Try to save it again on exit of TSmatch application.
ru: [SavedReport.error] : Сохраненный отчет по модели испорчен. Попытайтесь сохранить его заново при выходе из приложения TSmatch

# SavedReport__error_Corrupted_saved_report_TSmatchINFO
source: [SavedReport.error] : Saved model report in "TSmatchINFO.xlsx" is corrupted. Please, try to write it again in TSmatch application, when model in Tecla is available.
ru: [SavedReport.error] : Испорчен файл TSmatchINFO.xlsx Попробуйте записать его заново при выходе из приложения TSmatch

# SavedReport__Raw_CAD_Read
source: [SavedReport.Raw]: File "Raw.xml" is corrupted or unavailable. Would you like to read it from CAD once again?
ru: [SavedReport.Raw]: Файл "Raw.xml" не доступен или испорчен. Вы действительно хотите получить его из САПР заново?

# SavedReport__Raw_No_model_dir
source: [SavedReport.Raw]: not found model directory, pointed by TSmatchINFO.xlsx, or written in Windows Environment "{0}" and there is no Tekla active to read and re-create it again. Please, try to run TSmatch on PC with Tekla.
ru: [SavedReport.Raw]: не найден каталог модели, на который указывает запись в TSmatchINFO.xlsx или записано в регистре Windows "{0}" Это сообщение возникает, когда нет файла TSmatchINFO.xlsx, и нет Tekla, чтобы его можно было создать заново. Попробуйте запустить TSmatch на машине, где есть Tekla.
